tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
/*
 * esp8266_at_command.c
 *
 *  Created on: 2016/01/11
 *      Author: masuda
 */

#include	"gw.h"
#include	"esp8266_at_command.h"

static char		cmd_req[128];
static char		cmd_param[128];
static uint8_t	cmd_resp[2048];
static uint32_t	resp_len = 0;
static uint32_t	delimiter_id = DLMT_Normal;
static bool		multi_conn = false;
static bool		show_remote_info = false;
static bool		send_mode = false;
static volatile bool	at_completed = false;
static volatile bool	ipd_received = false;

///////////////////////////////////////////////////////////////////////////////
//
// AT Command Table
//
///////////////////////////////////////////////////////////////////////////////
static const char*	cmd_string[] = {
		// AT Command
		"AT",				// 0 : Test AT startup
		"AT+RST",			// 1 : Restart module
		"AT+GMR",			// 2 : View version info
		"AT+GSLP",			// 3 : Enter deep-sleep mode
		"ATE0",				// 4 : AT commands echo off
		"ATE1",				// 5 : AT commands echo on
		"AT+RESTORE",		// 6 : Factory Reset
		"AT+UART_CUR",		// 7 : UART current configuration
		"AT+UART_DEF",		// 8 : UART default configuration, save to flash
		"AT+SLEEP",			// 9 : Sleep mode
		"AT+RFPOWER",		// 10 : Set maximum value of RF TX Power
		"AT+RFVDD",			// 11 : Set RF TX Power according to VDD33
		// AT WiFi Command
		"AT+CWMODE_CUR",	// 12 : Wi-Fi mode（sta/AP/sta+AP）
		"AT+CWMODE_DEF",	// 13 : Wi-Fi default mode（sta/AP/sta+AP）. Save to Flash
		"AT+CWJAP_CUR",		// 14 : Connect to AP, won’t save to Flash
		"AT+CWJAP_DEF",		// 15 : Connect to AP, save to Flash
		"AT+CWLAP",			// 16 : Lists available APs
		"AT+CWQAP",			// 17 : Disconnect from AP
		"AT+CWSAP_CUR",		// 18 : Set configuration of ESP8266 soft-AP, won’t save to Flash
		"AT+CWSAP_DEF",		// 19 : Set configuration of ESP8266 soft-AP, save to Flash
		"AT+CWLIF",			// 20 : Get station’s IP which is connected to ESP8266 soft-AP
		"AT+CWDHCP_CUR",	// 21 : Enable/Disable DHCP, won’t save to Flash
		"AT+CWDHCP_DEF",	// 22 : Enable/Disable DHCP, save to Flash
		"AT+CWDHCPS_CUR",	// 23 : Set IP range of DHCP server, won’t save to Flash
		"AT+CWDHCPS_DEF",	// 24 : Set IP range of DHCP server, save to Flash
		"AT+CWAUTOCONN",	// 25 : Connect to AP automatically when power on
		"AT+CIPSTAMAC_CUR",	// 26 : Set MAC address of ESP8266 station, won’t save to Flash
		"AT+CIPSTAMAC_DEF",	// 27 : Set MAC address of ESP8266 station, save to Flash
		"AT+CIPAPMAC_CUR",	// 28 : Set MAC address of ESP8266 soft-AP, won’t save to Flash
		"AT+CIPAPMAC_DEF",	// 29 : Set MAC address of ESP8266 soft-AP, save to Flash
		"AT+CIPSTA_CUR",	// 30 : Set IP address of ESP8266 station, won’t save to Flash
		"AT+CIPSTA_DEF",	// 31 : Set IP address of ESP8266 station, save to Flash
		"AT+CIPAP_CUR",		// 32 : Set IP address of ESP8266 soft-AP, won’t save to Flash
		"AT+CIPAP_DEF",		// 33 : Set IP address of ESP8266 soft-AP, save to Flash
		"AT+STARTSMART",	// 34 : Start SmartConfig
		"AT+STOPSMART",		// 35 : Stop SmartConfig
		// AT TCP/IP Command
		"AT+CIPSTATUS",		// 36 : Get connection status
		"AT+CIPSTART",		// 37 : Establish TCP connection or register UDP port
		"AT+CIPSEND",		// 38 : Send data
		"AT+CIPSENDEX",		// 39 : Send data, if <length> or “\0” is met, data will be sent
		"AT+CIPSENDBUF",	// 40 : Write data into TCP-send-buffer
		"AT+CIPBUFRESET",	// 41 : Reset segment ID count
		"AT+CIPBUFSTATUS",	// 42 : Check status of TCP-send-buffer
		"AT+CIPCHECKSEQ",	// 43 : Check if a specific segment is sent or not
		"AT+CIPCLOSE",		// 44 : Close TCP/UDP connection
		"AT+CIFSR",			// 45 : Get local IP address
		"AT+CIPMUX",		// 46 : Set multiple connections mode
		"AT+CIPSERVER",		// 47 : Configure as server
		"AT+CIPMODE",		// 48 : Set transmission mode
		"AT+SAVETRANSLINK",	// 49 : Save transparent transmission link to Flash
		"AT+CIPSTO",		// 50 : Set timeout when ESP8266 runs as TCP server
		"AT+CIUPDATE",		// 51 : Upgrade firmware through network
		"AT+PING",			// 52 : Function PING
		"AT+CIPDINFO",		// 53 : Show remote IP and remote port with “+IPD”
};

static const char*	delimiter_str[][3] = {
		{"OK\r\n", "FAIL\r\n", "ERROR\r\n"},
		{"OK\r\n", "ERROR\r\n", "ALREADY CONNECT\r\n"},
		{"OK\r\n", "Link is builded\r\n", NULL},
		{">", NULL, NULL},
		{"SEND OK\r\n", NULL, NULL}
};

///////////////////////////////////////////////////////////////////////////////
//
// Receive Completed Callback Functions Prototype
// These are called from UART interrupt handler
//
///////////////////////////////////////////////////////////////////////////////
static uint32_t At_Command(uint32_t cmd_id, AT_CMD_TYPE cmd_type);
static bool IsOK(char* string);
static bool AT_Get_Param(char* src, uint32_t index, char* dst, uint32_t dst_size);
static bool IPD_Get_Param(char* src, uint32_t index, char* dst, uint32_t dst_size);
static void AT_Set_Delimiter(DLMT_STR_TYPE id);
static bool Is_AT_Completed(void);
static bool AT_Receive_Completed(char* buffer, uint32_t length);
static bool IPD_Receive_Completed(char* buffer, uint32_t length);
static bool _Receive_Completed(char* buffer, uint32_t length);
static bool IPD_Get_Param(char* src, uint32_t index, char* dst, uint32_t dst_size);

void AT_Prepare(void)
{
	// Clear response buffer
	memset(cmd_resp, 0, sizeof(cmd_resp));

	// Register AT Command Receive Completed Handler(It will be called from UART interrupt handler.)
	Uart_Register_Receive_Completed_Handler(0, _Receive_Completed);
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		At_Command
// 機能：
//		指定されたIDとタイプに合致するESP8266のATコマンドを実行する。
//　引数：
//		cmd_id : ATコマンドテーブルにおけるインデックス
//		cdm_type : Test, Query, Set, Executeのどれかを示すコマンドタイプ
// 戻り値
//		受信データサイズ
//
///////////////////////////////////////////////////////////////////////////////
#if 0
uint32_t At_Command(uint32_t cmd_id, AT_CMD_TYPE cmd_type)
{
	uint32_t	length;
	char**		delimiter;
	uint32_t	num;

	strcpy(cmd_req, cmd_string[cmd_id]);

	//
	// Make command string by command type
	//
	switch(cmd_type){
	case Cmd_Test:
		strcat(cmd_req, "=?\r\n");
		break;
	case Cmd_Query:
		strcat(cmd_req, "?\r\n");
		break;
	case Cmd_Set:
		strcat(cmd_req, "=");
		strcat(cmd_req, cmd_param);
		strcat(cmd_req, "\r\n");
		break;
	case Cmd_Execute:
		strcat(cmd_req, "\r\n");
		break;
	default:
		break;
	}

	// Register AT Command Receive Completed Handler(It will be called from UART interrupt handler.)
	Uart_Register_Receive_Completed_Handler(0, _Receive_Completed);

	// Set receive buffer
	Uart_Set_Receive_Buffer(UART_INDEX, cmd_resp, sizeof(cmd_resp));

	// Send data asynchronously
	Uart_Send_Data_Sync(UART_INDEX, cmd_req, strlen(cmd_req));

