tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	length = Uart_Receive_Data_Sync(UART_INDEX, cmd_resp, sizeof(cmd_resp));

	return length;
}
#else
uint32_t At_Command(uint32_t cmd_id, AT_CMD_TYPE cmd_type)
{
	char**		delimiter;
	uint32_t	num;
	uint32_t	status;

	// Check if send mode
	if(send_mode){
		return false;
	}

	strcpy(cmd_req, cmd_string[cmd_id]);

	//
	// Make command string by command type
	//
	switch(cmd_type){
	case Cmd_Test:
		strcat(cmd_req, "=?\r\n");
		break;
	case Cmd_Query:
		strcat(cmd_req, "?\r\n");
		break;
	case Cmd_Set:
		strcat(cmd_req, "=");
		strcat(cmd_req, cmd_param);
		strcat(cmd_req, "\r\n");
		break;
	case Cmd_Execute:
		strcat(cmd_req, "\r\n");
		break;
	default:
		break;
	}

	// Receive buffer clear
	cmd_resp[0] = '\0';
	// Set receive buffer
	Uart_Set_Receive_Buffer(UART_INDEX, cmd_resp, sizeof(cmd_resp));

	// Send data asynchronously
	if(!Uart_Send_Data_Async(UART_INDEX, cmd_req, strlen(cmd_req))){
		return false;
	}

	// Wait until receiving response from ESP8266 completed
	while(!Is_AT_Completed()){
		continue;
	}

	// Get received data count
	resp_len = Uart_Receive_Data_Count(UART_INDEX);

	// Reset receive buffer
	Uart_Set_Receive_Buffer(UART_INDEX, NULL, 0);

	return resp_len;
}
#endif
///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		IsOK
// 機能：
//		指定された文字列に"OK"が含まれるかどうかを示す。
//　引数：
//		string : 検査する文字列
// 戻り値
//		true - "OK"を検出、false - 適合せず
//
///////////////////////////////////////////////////////////////////////////////
bool IsOK(char* string)
{
	if(NULL == strstr(string, "OK")){
		return false;
	}

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		AT_Get_Param
// 機能：
//		受信バッファに含まれるパラメータの値を抽出
//　引数：
//		src : 検査する文字列
//		index - 文字列に含まれるパラメータのインデックス
//		dst - パラメータを文字列のまま格納するバッファ
//		dst_size - dstのバッファサイズ
// 戻り値
//		true - 成功、false - 失敗
//
///////////////////////////////////////////////////////////////////////////////
bool AT_Get_Param(char* src, uint32_t index, char* dst, uint32_t dst_size)
{
	uint32_t	i;
	char*	ptr;
	char*	next;

	// Parameter starts after ":"
	ptr = strchr(src, ':');
	if(NULL == ptr){
		ptr = src;
	}

	ptr++;
	if(index > 0){
		for(i = 0; i < index; i++){
			// Parameter starts after ","
			ptr = strchr(ptr, ',');
			if(NULL == ptr){
				return false;
			}
			ptr++;
		}
	}

	// Skip first double quotation and space
	while(*ptr == '\"' || *ptr == ' '){
		ptr++;
	}

	// Get next delimiter, ',' or '\r'
	next = strchr(ptr, ',');
	if(!next){
		next = strchr(ptr, '\r');
		if(!next){
			return false;
		}
	}

	i = 0;
	while(ptr != next && *ptr != '\"'){
		dst[i++] = *ptr++;
		if(dst_size < i){
			return false;
		}
	}

	// Remove space from the end of string
	while(dst[i - 1] == ' '){
		i--;
	}

	// Null terminated
	dst[i] = '\0';

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		IPD_Get_Param
// 機能：
//		IPDコマンドの受信データに含まれるパラメータの値を抽出
//　引数：
//		src : 検査する文字列
//		index - 文字列に含まれるパラメータのインデックス
//		dst - パラメータを文字列のまま格納するバッファ
//		dst_size - dstのバッファサイズ
// 戻り値
//		true - 成功、false - 失敗
//
///////////////////////////////////////////////////////////////////////////////
bool IPD_Get_Param(char* src, uint32_t index, char* dst, uint32_t dst_size)
{
	uint32_t	i;
	uint32_t	length;
	char*		ptr;
	char*		next;

	// index is less than or equal to 3
	if(index > 3){
		return false;
	}

	// First string is "+IPD,", so search for comma
	ptr = strchr(src, ',');
	ptr++;

	for(i = 0; i < index; i++){
		ptr = strchr(ptr, ',');
		ptr++;
	}

	// Search for the delimiter pointer next to the data we want to get
	next = strchr(ptr, ',');
	if(NULL == next){
		next = strchr(ptr, ':');
		if(NULL == next){
			return false;
		}
	}

	// next is always greater than ptr
	if((uint32_t)next <= (uint32_t)ptr){
		return false;
	}

	// Get data length
	length = (uint32_t)(next - ptr);
	// Check if data buffer has enough size
	if(length > dst_size){
		return false;
	}

	// Skip first double quotation and space
	while(*ptr == '\"' || *ptr == ' '){
		ptr++;
	}

	i = 0;
	while(ptr != next && *ptr != '\"'){
		dst[i++] = *ptr++;
	}

	// Remove space from the end of string
	while(dst[i - 1] == ' '){
		i--;
	}

	// Null terminated
	dst[i] = '\0';

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		AT_Set_Delimiter
// 機能：
//		コマンドが返す最後の文字列を設定する。
//　引数：
//		id : デリミタ文字列を示すインデックス
//
///////////////////////////////////////////////////////////////////////////////
void AT_Set_Delimiter(DLMT_STR_TYPE id)
{
	delimiter_id = id;
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		Is_AT_Completed
// 機能：
//		ATコマンドが完了したかどうかを示す。
//　引数：
//		なし
// 戻り値
//		true : 完了、false : 未完了
//
///////////////////////////////////////////////////////////////////////////////
bool Is_AT_Completed(void)
{
	if(at_completed){
		at_completed = false;
		return true;
	}
	else{
		return false;
	}
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		Is_IPD_Received
// 機能：
//		IPDコマンドを受信したかどうかを示す。
//　引数：
//		なし
// 戻り値
//		true : 受信、false : 未受信
//
///////////////////////////////////////////////////////////////////////////////
bool Is_IPD_Received(void)
{
	if(ipd_received){
		ipd_received = false;
		return true;
	}
	else{
		return false;
	}
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		AT_Receive_Completed
// 機能：
//		ATコマンドの受信完了を判定する。
//　引数：
//		buffer : 受信バッファのポインタ
//		length - 受信データ長
// 戻り値
//		true - 受信完了、false - 受信継続
//
///////////////////////////////////////////////////////////////////////////////
bool AT_Receive_Completed(char* buffer, uint32_t length)
{
	uint32_t	i, j;
	uint32_t	cnt;
	const char*	delimiter;
	bool		flag;

	for(i = 0; i < 3 && NULL != delimiter_str[delimiter_id][i]; i++){
		delimiter = delimiter_str[delimiter_id][i];
		cnt = strlen(delimiter);
		flag = true;
		for(j = 0; j < cnt; j++){
			if(buffer[length - cnt + j] != delimiter[j]){
				flag = false;
				break;
			}
		}
		if(flag){
			break;
		}
	}

