tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	return flag;
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		IPD_Receive_Completed
// 機能：
//		ESP8266からのIPDコマンドの受信完了を判定する。
//　引数：
//		buffer : 受信バッファのポインタ
//		length - 受信データ長
// 戻り値
//		true - 受信完了、false - 受信継続
//
///////////////////////////////////////////////////////////////////////////////
#if 0
bool IPD_Receive_Completed(char* buffer, uint32_t length)
{
	uint32_t	i;
	uint32_t	datalen;
	uint32_t	id;
	uint32_t	port;
	char*		ptr;

	ptr = strchr(buffer, ':');
	if(!ptr){
		return false;
	}
	ptr++;

	// Multiple connection
	if(multi_conn){
		// Show remote information
		if(show_remote_info){
			sscanf(buffer, "+IPD,%d,%d,", &id, &datalen);
		}
		// Doesn't show remote information
		else{
			sscanf(buffer, "+IPD,%d,%d:", &id, &datalen);
		}
	}
	// Single connection
	else{
		// Show remote information
		if(show_remote_info){
			sscanf(buffer, "+IPD,%d,", &datalen);
		}
		// Doesn't show remote information
		else{
			sscanf(buffer, "+IPD,%d:", &datalen);
		}
	}

	datalen += (uint32_t)(ptr - buffer);

	return (length >= datalen);
}
#else
bool IPD_Receive_Completed(char* buffer, uint32_t length)
{
	uint32_t	datalen;
	uint32_t	len;
	char*		ptr;
	char*		data_start;

	// Search first comma
	ptr = strchr(buffer, ',');
	if(NULL == ptr){
		return false;
	}

	// Multi connection mode
	if(multi_conn){
		// Search next comma
		ptr++;
		ptr = strchr(ptr, ',');
		if(NULL == ptr){
			return false;
		}
	}

	// Search colon
	ptr++;
	data_start = strchr(ptr, ':');
	if(NULL == data_start){
		return false;
	}
	data_start++;

	// Show remote information
	if(show_remote_info){
		sscanf(ptr, "%d,", &datalen);
	}
	// Not show remote information
	else{
		sscanf(ptr, "%d:", &datalen);
	}

	if(buffer + length != data_start + datalen){
		ipd_received = false;
	}
	else{
		ipd_received = true;
	}

	return ipd_received;
}
#endif

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		_Receive_Completed
// 機能：
//		UART割込み処理の中で受信完了を判定する。
//　引数：
//		buffer : 受信バッファのポインタ
//		length - 受信データ長
// 戻り値
//		true - 受信完了、false - 受信継続
//
///////////////////////////////////////////////////////////////////////////////
bool _Receive_Completed(char* buffer, uint32_t length)
{
	bool		ipd_cmd = false;

	if(length < 4){
		return false;
	}

	if(0 == strncmp(buffer, "+IPD", 4)){
		ipd_cmd = true;
	}

	// IPD command received
	if(ipd_cmd){
		ipd_received = IPD_Receive_Completed(buffer, length);
		if(ipd_received){
			// Command received from WiFi, invoke Task
		}

		return ipd_received;
	}
	// AT command completed
	else{
		at_completed = AT_Receive_Completed(buffer, length);
		if(at_completed){
			// AT completed, do something ...
		}

		return at_completed;
	}
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		IPD_Get_Command
// 機能：
//		受信したIPDコマンドのデータを取得する。
//　引数：
//		ipd_info : IPDコマンドに含まれる情報
// 戻り値
//		true - 受信データあり、false - 受信データなし
//
///////////////////////////////////////////////////////////////////////////////
bool IPD_Get_Command(IPD_INFO* ipd_info)
{
	uint32_t	data_num;
	char*		ptr;
	char		ret_val[128];
	bool		result;

	// IPD command received
	if(!ipd_received){
		return false;
	}

	ipd_info->multi_conn = multi_conn;
	ipd_info->show_remote = show_remote_info;

	// Get first parameter
	result = IPD_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}

	// Multiple connection
	if(multi_conn){
		// Get connection ID
		sscanf(ret_val, "%d", &ipd_info->conn_id);

		// Get data length
		result = IPD_Get_Param(cmd_resp, 1, ret_val, sizeof(ret_val));
		if(!result){
			return false;
		}
		sscanf(ret_val, "%d", &ipd_info->data_len);

		// Data count = 2
		data_num = 2;
	}
	// Single connection
	else{
		// Get data length
		sscanf(ret_val, "%d", &ipd_info->data_len);
		data_num = 1;
	}

	// Check data buffer length
	if(ipd_info->data_len > ipd_info->data_buf_size){
		return false;
	}

	// In case of showing remote information
	if(show_remote_info){
		data_num += 2;

		// Get remote IP address
		result = IPD_Get_Param(cmd_resp, data_num - 2, ipd_info->remote_ip, ipd_info->remote_ip_len);
		if(!result){
			return false;
		}

		// Get remote port number
		result = IPD_Get_Param(cmd_resp, data_num - 1, ret_val, sizeof(ret_val));
		if(!result){
			return false;
		}
		sscanf(ret_val, "%d", &ipd_info->remote_port);
	}

	// Search for first data pointer
	ptr = strchr(cmd_resp, ':');
	if(NULL == ptr){
		return false;
	}
	ptr++;

	// Get received data
	memcpy(ipd_info->data, ptr, ipd_info->data_len);
	// Null terminate received data
	ipd_info->data[ipd_info->data_len] = '\0';

	// Reset IPD received flag
	ipd_received = false;

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Basic AT Command Set
//
///////////////////////////////////////////////////////////////////////////////

bool AT_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_AT, Cmd_Execute);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_RST_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_RST, Cmd_Execute);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_GMR_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_GMR_OUT*	param = (AT_GMR_OUT*)output;
	bool		result;
	char*		ptr;
	char*		line_end;

	if(NULL == output || sizeof(AT_GMR_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_GMR, Cmd_Execute);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Get AT version info
	ptr = strstr(cmd_resp, "AT version");
	line_end = strchr(ptr, '\r');
	length = (uint32_t)(line_end - ptr) + 1;
	if(param->at_ver_len < length){
		return false;
	}
	strncpy(param->at_ver, ptr, length - 1);

	// Get SDK version info
	ptr = strstr(cmd_resp, "SDK version");
	line_end = strchr(ptr, '\r');
	length = (uint32_t)(line_end - ptr) + 1;
	if(param->sdk_ver_len < length){
		return false;
	}
	strncpy(param->sdk_ver, ptr, length - 1);

	// Get compile time
	ptr = strstr(cmd_resp, "compile time");
	line_end = strchr(ptr, '\r');
	length = (uint32_t)(line_end - ptr) + 1;
	if(param->compile_time_len < length){
		return false;
	}
	strncpy(param->compile_time, ptr, length - 1);

