tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Confirm OK string
	return true;
}

bool AT_GSLP_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	msec = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*msec) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", *msec);
	// AT Command Process
	length = At_Command(CMD_GSLP, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_ATE_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	bool*		echo = (bool*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*echo) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	if(*echo){
		length = At_Command(CMD_ATE1, Cmd_Execute);
	}
	else{
		length = At_Command(CMD_ATE0, Cmd_Execute);
	}

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_RESTORE_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_RESTORE, Cmd_Execute);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_UART_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_UART_IN*	param = (AT_UART_IN*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_UART_IN) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d,%d,%d,%d,%d", param->baudrate, param->databits, param->stopbits, param->parity, param->flow);
	// AT Command Process
	length = At_Command(CMD_UART_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_UART_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_UART_IN*	param = (AT_UART_IN*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_UART_IN) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d,%d,%d,%d,%d", param->baudrate, param->databits, param->stopbits, param->parity, param->flow);
	// AT Command Process
	length = At_Command(CMD_UART_DEF, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_SLEEP_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)output;
	char		ret_val[4];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*mode) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_SLEEP, Cmd_Query);

	// Confirm OK string
	result = IsOK(cmd_resp);
	// Get Sleep Mode
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", mode);

	return result;
}

bool AT_SLEEP_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*mode) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", *mode);
	// AT Command Process
	length = At_Command(CMD_SLEEP, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_RFPOWER_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	power = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*power) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", *power);
	// AT Command Process
	length = At_Command(CMD_RFPOWER, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_RFVDD_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	vdd = (uint32_t*)output;
	char		ret_val[16];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*vdd) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_RFVDD, Cmd_Query);

	// Confirm OK string
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}
	// Get VDD33
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", vdd);

	return result;
}

bool AT_RFVDD_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	vdd = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*vdd) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", *vdd);
	// AT Command Process
	length = At_Command(CMD_RFVDD, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

bool AT_RFVDD_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_RFVDD, Cmd_Execute);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// WiFi AT Command Set
//
///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWMODE_CUR=?
//
// Function: Current WiFi Mode Query
//
// 1 : Station Mode
// 2 : softAP Mode
// 3 : softAP + Station Mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWMODE_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)output;
	char		ret_val[4];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*mode) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWMODE_CUR, Cmd_Query);

