tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Confirm OK string
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}
	// Get WiFi Mode
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", mode);

	return result;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWMODE_CUR=<mode>
//
// Function: Current WiFi Mode Set(won't save flash)
//
// 1 : Station Mode
// 2 : softAP Mode
// 3 : softAP + Station Mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWMODE_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*mode) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", *mode);
	// AT Command Process
	length = At_Command(CMD_CWMODE_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWMODE_DEF=?
//
// Function: Default WiFi Mode Query
//
// 1 : Station Mode
// 2 : softAP Mode
// 3 : softAP + Station Mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWMODE_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)output;
	char		ret_val[4];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*mode) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWMODE_DEF, Cmd_Query);

	// Confirm OK string
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}
	// Get WiFi Mode
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", mode);

	return result;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWMODE_DEF=<mode>
//
// Function: Default WiFi Mode Set(save to flash)
//
// 1 : Station Mode
// 2 : softAP Mode
// 3 : softAP + Station Mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWMODE_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*mode) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", *mode);
	// AT Command Process
	length = At_Command(CMD_CWMODE_DEF, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWJAP_CUR?
//
// Function: Connect to AP
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWJAP_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t		length;
	AT_CWJAP_OUT*	param = (AT_CWJAP_OUT*)output;
	char			ret_val[8];
	bool			result;

	// Check output buffer length
	if(NULL == output || sizeof(AT_CWJAP_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWJAP_CUR, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "+CWJAP_CUR:<ssid>,<bssid>,<channel>,<rssi>\r\n"
	// Get ssid
	result = AT_Get_Param(cmd_resp, 0, param->ssid, param->ssid_len);
	if(!result){
		return false;
	}
	// Get bssid
	result = AT_Get_Param(cmd_resp, 1, param->bssid, param->bssid_len);
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->channel);
	result = AT_Get_Param(cmd_resp, 3, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->rssi);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWJAP_CUR=<ssid>,<password>[,<bssid>]
//
// Function: Connect to AP(won't save to flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWJAP_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t		length;
	AT_CWJAP_IN*	param = (AT_CWJAP_IN*)input;
	uint32_t*		error = (uint32_t*)output;
	char			ret_val[8];
	bool			result;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWJAP_IN) > input_len){
		return false;
	}

	// Check output buffer length
	if(NULL == output || sizeof(*error) > output_len){
		return false;
	}

	// Set "OK" and "FAIL" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	if(param->bssid){
		sprintf(cmd_param, "\"%s\",\"%s\",\"%s\"", param->ssid, param->passwd, param->bssid);
	}
	else{
		sprintf(cmd_param, "\"%s\",\"%s\"", param->ssid, param->passwd);
	}
	// AT Command Process
	length = At_Command(CMD_CWJAP_CUR, Cmd_Set);

	// Confirm OK string
	result = IsOK(cmd_resp);
	if(!result){
		// If failed, get error code
		result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
		if(!result){
			return false;
		}
		sscanf(ret_val, "%d", error);
		return false;
	}

	// Command successful
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWJAP_DEF?
//
// Function: Connect to AP
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWJAP_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t		length;
	AT_CWJAP_OUT*	param = (AT_CWJAP_OUT*)output;
	char			ret_val[8];
	bool			result;

	// Check input buffer length
	if(NULL == output || sizeof(AT_CWJAP_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWJAP_DEF, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

