tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Return string is "+CWJAP_CUR:<ssid>,<bssid>,<channel>,<rssi>\r\n"
	// Get ssid
	result = AT_Get_Param(cmd_resp, 0, param->ssid, param->ssid_len);
	if(!result){
		return false;
	}
	// Get bssid
	result = AT_Get_Param(cmd_resp, 1, param->bssid, param->bssid_len);
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->channel);
	result = AT_Get_Param(cmd_resp, 3, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->rssi);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWJAP_DEF=<ssid>,<password>[,<bssid>]
//
// Function: Connect to AP(won't save to flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWJAP_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t		length;
	AT_CWJAP_IN*	param = (AT_CWJAP_IN*)input;
	uint32_t*		error = (uint32_t*)output;
	char			ret_val[8];
	bool			result;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWJAP_IN) > input_len){
		return false;
	}

	// Check output buffer length
	if(NULL == output || sizeof(*error) > output_len){
		return false;
	}

	// Set "OK" and "FAIL" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	if(param->bssid){
		sprintf(cmd_param, "\"%s\",\"%s\",\"%s\"", param->ssid, param->passwd, param->bssid);
	}
	else{
		sprintf(cmd_param, "\"%s\",\"%s\"", param->ssid, param->passwd);
	}
	// AT Command Process
	length = At_Command(CMD_CWJAP_DEF, Cmd_Set);

	// Confirm OK string
	result = IsOK(cmd_resp);
	if(!result){
		// If failed, get error code
		result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
		if(!result){
			return false;
		}
		sscanf(ret_val, "%d", error);
		return false;
	}

	// Command successful
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWLAP=<ssid>[,<mac>,<ch>]
//
// Function: List available AP's
//
// ecn:
//	0 : OPEN
//	1 : WEP
//	2 : WPA_PSK
//	3 : WPA2_PSK
//	4 : WPA_WPA2_PSK
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWLAP_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t		length;
	AT_CWLAP_IN*	param = (AT_CWLAP_IN*)input;
	uint32_t*		ecn = (uint32_t*)output;
	char			ret_val[8];
	bool			result;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWLAP_IN) > input_len){
		return false;
	}

	// Check output buffer length
	if(NULL == output || sizeof(*ecn) > output_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	if(!param->set_ssid_only){
		sprintf(cmd_param, "\"%s\",\"%02x:%02x:%02x:%02x:%02x:%02x\",%d",
				param->ssid, param->mac[0], param->mac[1], param->mac[2],
				param->mac[3], param->mac[4], param->mac[5], param->channel);
	}
	else{
		sprintf(cmd_param, "\"%s\"", param->ssid);
	}
	// AT Command Process
	length = At_Command(CMD_CWLAP, Cmd_Set);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", ecn);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWLAP
//
// Function: List available AP's
//
// ecn:
//	0 : OPEN
//	1 : WEP
//	2 : WPA_PSK
//	3 : WPA2_PSK
//	4 : WPA_WPA2_PSK
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWLAP_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWLAP_OUT*	param = (AT_CWLAP_OUT*)output;
	char		ret_val[20];
	bool		result;
	uint32_t	i;
	uint32_t	mac[6];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CWLAP_OUT) > output_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// AT Command Process
	length = At_Command(CMD_CWLAP, Cmd_Execute);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "+CWLAP:<ecn>,<ssid>,<rssi>,<mac>,<ch>,<freq offset>, <freq calibration>\r\n"
	// Get <ecn>
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->ecn);
	// Get <ssid>
	result = AT_Get_Param(cmd_resp, 1, param->ssid, param->ssid_len);
	if(!result){
		return false;
	}
	// Get <rssi>
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->rssi);
	// Get mac address
	result = AT_Get_Param(cmd_resp, 3, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%02x:%02x:%02x:%02x:%02x:%02x", &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]);
	for(i = 0; i < 6; i++){
		param->mac[i] = (uint8_t)mac[i];
	}
	// Get <channel>
	result = AT_Get_Param(cmd_resp, 4, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->channel);
	// Get <freq_off>
	result = AT_Get_Param(cmd_resp, 5, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->freq_off);
	// Get <freq_cal>
	result = AT_Get_Param(cmd_resp, 6, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->freq_cal);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWQAP
//
// Function: Disconnect from AP
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWQAP_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWQAP, Cmd_Execute);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWSAP_CUR?
//
// Function: Current config of softAP mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWSAP_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWSAP_IN_OUT*	param = (AT_CWSAP_IN_OUT*)output;
	char			ret_val[8];
	bool			result;

	// Check output buffer length
	if(NULL == output || sizeof(AT_CWSAP_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWSAP_CUR, Cmd_Query);
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

