tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Return string is "+CWSAP_CUR:<ssid>,<passwd>,<channel>,<ecn>,<max conn>,<ssid hidden>\r\n"
	result = AT_Get_Param(cmd_resp, 0, param->ssid, param->ssid_len);
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 1, param->passwd, param->passwd_len);
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->channel);
	result = AT_Get_Param(cmd_resp, 3, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->ecn);
	result = AT_Get_Param(cmd_resp, 4, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->max_conn);
	result = AT_Get_Param(cmd_resp, 5, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->ssid_hidden);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWSAP_CUR=<ssid>,<passwd>,<channel>,<ecn>,<max conn>,<ssid hidden>
//
// Function: Current config of softAP mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWSAP_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWSAP_IN_OUT*	param = (AT_CWSAP_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWSAP_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// Create param string
	sprintf(cmd_param, "\"%s\",\"%s\",%d,%d,%d,%d",
			param->ssid, param->passwd, param->channel, param->ecn,
			param->max_conn, param->ssid_hidden);
	// AT Command Process
	length = At_Command(CMD_CWSAP_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWSAP_DEF?
//
// Function: Current config of softAP mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWSAP_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWSAP_IN_OUT*	param = (AT_CWSAP_IN_OUT*)output;
	char			ret_val[8];
	bool			result;

	// Check output buffer length
	if(NULL == output || sizeof(AT_CWSAP_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWSAP_DEF, Cmd_Query);
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "+CWSAP_CUR:<ssid>,<passwd>,<channel>,<ecn>,<max conn>,<ssid hidden>\r\n"
	result = AT_Get_Param(cmd_resp, 0, param->ssid, param->ssid_len);
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 1, param->passwd, param->passwd_len);
	if(!result){
		return false;
	}
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->channel);
	result = AT_Get_Param(cmd_resp, 3, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->ecn);
	result = AT_Get_Param(cmd_resp, 4, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->max_conn);
	result = AT_Get_Param(cmd_resp, 5, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", param->ssid_hidden);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWSAP_DEF=<ssid>,<passwd>,<channel>,<ecn>,<max conn>,<ssid hidden>
//
// Function: Set Current config of softAP mode(will save to flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWSAP_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWSAP_IN_OUT*	param = (AT_CWSAP_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWSAP_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// Create param string
	sprintf(cmd_param, "\"%s\",\"%s\",%d,%d,%d,%d",
			param->ssid, param->passwd, param->channel, param->ecn,
			param->max_conn, param->ssid_hidden);
	// AT Command Process
	length = At_Command(CMD_CWSAP_DEF, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

#if 1
///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWLIF
//
// Function: IP of stations
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWLIF_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWLIF_OUT*	param = (AT_CWLIF_OUT*)output;
	char			ret_val[20];
	bool			result;
	uint32_t		i;
	uint32_t		ip[4], mac[6];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CWLIF_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWLIF, Cmd_Execute);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "<IP addr>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip[i] = (uint8_t)ip[i];
	}

	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%02x:%02x:%02x:%02x:%02x:%02x", &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]);
	for(i = 0; i < 6; i++){
		param->mac[i] = (uint8_t)mac[i];
	}

	// Confirm OK string
	return true;
}
#endif

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCP_CUR
//
// Function: Enable/Disable DHCP
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCP_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)output;
	char		ret_val[4];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*mode) < output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWDHCP_CUR, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

