tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", mode);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCP_CUR=<mode>,<en>
//	<mode>
//		0 : set ESP8266 softAP
//		1 : set ESP8266 station
//		2 : set both softAP and station
//	<en>
//		0 : Disable DHCP
//		1 : Enable DHCP
//
// Function: Enable/Disable DHCP
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCP_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWDHCP_IN*	param = (AT_CWDHCP_IN*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWDHCP_IN) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d,%d", param->mode, param->en);
	// AT Command Process
	length = At_Command(CMD_CWDHCP_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCP_DEF?
//
// Function: Enable/Disable DHCP
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCP_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)output;
	char		ret_val[4];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*mode) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWDHCP_DEF, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", mode);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCP_DEF=<mode>,<en>
//	<mode>
//		0 : set ESP8266 softAP
//		1 : set ESP8266 station
//		2 : set both softAP and station
//	<en>
//		0 : Disable DHCP
//		1 : Enable DHCP
//
// Function: Enable/Disable DHCP
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCP_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWDHCP_IN*	param = (AT_CWDHCP_IN*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWDHCP_IN) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d,%d", param->mode, param->en);
	// AT Command Process
	length = At_Command(CMD_CWDHCP_DEF, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCPS_CUR?
//
// Function:
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCPS_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWDHCPS_IN_OUT*	param = (AT_CWDHCPS_IN_OUT*)output;
	char		ret_val[20];
	bool		result;

	// Check input buffer length
	if(NULL == output || sizeof(AT_CWDHCPS_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWDHCPS_CUR, Cmd_Query);

	// Return string is "+CWDHCPS_CUR=<lease time>,<start IP>,<end IP>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->lease_time);
	result = AT_Get_Param(cmd_resp, 1, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d",
			&param->start_ip[0], &param->start_ip[1], &param->start_ip[2], &param->start_ip[3]);
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d",
			&param->end_ip[0], &param->end_ip[1], &param->end_ip[2], &param->end_ip[3]);

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCPS_CUR=<enable>,<lease time>,<start IP>,<end IP>
//
// Function:
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCPS_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWDHCPS_IN_OUT*	param = (AT_CWDHCPS_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWDHCPS_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d,%d,\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"",
			param->enable, param->lease_time,
			param->start_ip[0], param->start_ip[1], param->start_ip[2], param->start_ip[3],
			param->end_ip[0], param->end_ip[1], param->end_ip[2], param->end_ip[3]);
	// AT Command Process
	length = At_Command(CMD_CWDHCPS_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCPS_DEF?
//
// Function:
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCPS_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWDHCPS_IN_OUT*	param = (AT_CWDHCPS_IN_OUT*)output;
	char		ret_val[20];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(AT_CWDHCPS_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWDHCPS_DEF, Cmd_Query);

	// Return string is "+CWDHCPS_CUR=<lease time>,<start IP>,<end IP>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->lease_time);
	result = AT_Get_Param(cmd_resp, 1, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d",
			&param->start_ip[0], &param->start_ip[1], &param->start_ip[2], &param->start_ip[3]);
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d",
			&param->end_ip[0], &param->end_ip[1], &param->end_ip[2], &param->end_ip[3]);

