tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWDHCPS_DEF=<enable>,<lease time>,<start IP>,<end IP>
//
// Function:
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWDHCPS_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CWDHCPS_IN_OUT*	param = (AT_CWDHCPS_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CWDHCPS_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d,%d,\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"",
			param->enable, param->lease_time,
			param->start_ip[0], param->start_ip[1], param->start_ip[2], param->start_ip[3],
			param->end_ip[0], param->end_ip[1], param->end_ip[2], param->end_ip[3]);
	// AT Command Process
	length = At_Command(CMD_CWDHCPS_DEF, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWAUTOCONN=<enable>
//
// Function: Connect to AP automatically or not
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWAUTOCONN_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	enable = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*enable) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", *enable);
	// AT Command Process
	length = At_Command(CMD_CWAUTOCONN, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTAMAC_CUR?
//
// Function: Set MAC address of ESP8266 station(won't save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTAMAC_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)output;
	char				ret_val[20];
	bool				result;
	uint32_t			i;
	uint32_t			mac[6];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPMAC_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CIPSTAMAC_CUR, Cmd_Query);
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "+CIPSTAMAC_CUR:<mac>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%02x:%02x:%02x:%02x:%02x:%02x", &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]);
	for(i = 0; i < 6; i++){
		param->mac[i] = (uint8_t)mac[i];
	}

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTAMAC_CUR=<mac>
//
// Function: Set MAC address of ESP8266 station(won't save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTAMAC_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPMAC_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "\"%02x:%02x:%02x:%02x:%02x:%02x\"",
			param->mac[0], param->mac[1], param->mac[2],
			param->mac[3], param->mac[4], param->mac[5]);
	// AT Command Process
	length = At_Command(CMD_CIPSTAMAC_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTAMAC_DEF?
//
// Function: Set MAC address of ESP8266 station(Save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTAMAC_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)output;
	char				ret_val[20];
	bool				result;
	uint32_t			i;
	uint32_t			mac[6];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPMAC_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CIPSTAMAC_DEF, Cmd_Query);
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "+CIPSTAMAC_CUR:<mac>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%02x:%02x:%02x:%02x:%02x:%02x", &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]);
	for(i = 0; i < 6; i++){
		param->mac[i] = (uint8_t)mac[i];
	}

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTAMAC_DEF=<mac>
//
// Function: Set MAC address of ESP8266 station(Save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTAMAC_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPMAC_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "\"%02x:%02x:%02x:%02x:%02x:%02x\"",
			param->mac[0], param->mac[1], param->mac[2],
			param->mac[3], param->mac[4], param->mac[5]);
	// AT Command Process
	length = At_Command(CMD_CIPSTAMAC_DEF, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPAPMAC_CUR?
//
// Function: Set MAC address of softAP(won't save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPAPMAC_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)output;
	char				ret_val[20];
	bool				result;
	uint32_t			i;
	uint32_t			mac[6];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPMAC_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CIPAPMAC_CUR, Cmd_Query);
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "+CIPSTAMAC_CUR:<mac>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%02x:%02x:%02x:%02x:%02x:%02x", &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]);
	for(i = 0; i < 6; i++){
		param->mac[i] = (uint8_t)mac[i];
	}

