tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPAPMAC_CUR=<mac>
//
// Function: Set MAC address of softAP(won't save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPAPMAC_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPMAC_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "\"%02x:%02x:%02x:%02x:%02x:%02x\"",
			param->mac[0], param->mac[1], param->mac[2],
			param->mac[3], param->mac[4], param->mac[5]);
	// AT Command Process
	length = At_Command(CMD_CIPAPMAC_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPAPMAC_DEF?
//
// Function: Set MAC address of softAP(Save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPAPMAC_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)output;
	char				ret_val[20];
	bool				result;
	uint32_t			i;
	uint32_t			mac[6];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPMAC_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CIPAPMAC_DEF, Cmd_Query);
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "+CIPSTAMAC_CUR:<mac>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%02x:%02x:%02x:%02x:%02x:%02x", &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]);
	for(i = 0; i < 6; i++){
		param->mac[i] = (uint8_t)mac[i];
	}

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPAPMAC_DEF=<mac>
//
// Function: Set MAC address of ESP8266 station(Save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPAPMAC_DEF_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPMAC_IN_OUT*	param = (AT_CIPMAC_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPMAC_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "\"%02x:%02x:%02x:%02x:%02x:%02x\"",
			param->mac[0], param->mac[1], param->mac[2],
			param->mac[3], param->mac[4], param->mac[5]);
	// AT Command Process
	length = At_Command(CMD_CIPAPMAC_DEF, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTA_CUR?
//
// Function: Set IP address of station(won't save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTA_CUR_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPADDR_IN_OUT*	param = (AT_CIPADDR_IN_OUT*)output;
	char			*ptr;
	char			ret_val[32];
	bool			result;
	uint32_t		i;
	uint32_t		ip[4];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPADDR_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CIPSTA_CUR, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	ptr = strstr(cmd_resp, "+CIPSTA_CUR:");
	ptr = strstr(ptr, "ip:");
	// Return string is "+CIPSTA_CUR:ip:\"xx.xx.xx.xx\"\r\n"
	result = AT_Get_Param(ptr, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip_station[i] = (uint8_t)ip[i];
	}

	ptr++;
	ptr = strstr(ptr, "gateway:");
	// Return string is "+CIPSTA_CUR:gateway:\"xx.xx.xx.xx\"\r\n"
	result = AT_Get_Param(ptr, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip_gateway[i] = (uint8_t)ip[i];
	}

	ptr++;
	ptr = strstr(ptr, "netmask:");
	// Return string is "+CIPSTA_CUR:netmask:\"xx.xx.xx.xx\"\r\n"
	result = AT_Get_Param(ptr, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip_netmask[i] = (uint8_t)ip[i];
	}

	// Confirm OK string
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTA_CUR=<IP>[,<gateway>,<netmask>]
//
// Function: Set IP address of station(won't save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTA_CUR_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPADDR_IN_OUT*	param = (AT_CIPADDR_IN_OUT*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPADDR_IN_OUT) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "\"%d.%d.%d.%d\",\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"",
			param->ip_station[0], param->ip_station[1], param->ip_station[2], param->ip_station[3],
			param->ip_gateway[0], param->ip_gateway[1], param->ip_gateway[2], param->ip_gateway[3],
			param->ip_netmask[0], param->ip_netmask[1], param->ip_netmask[2], param->ip_netmask[3]);
	// AT Command Process
	length = At_Command(CMD_CIPSTA_CUR, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTA_DEF?
//
// Function: Set IP address of station(Save to Flash)
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTA_DEF_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPADDR_IN_OUT*	param = (AT_CIPADDR_IN_OUT*)output;
	char			*ptr;
	char			ret_val[32];
	bool			result;
	uint32_t		i;
	uint32_t		ip[4];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPADDR_IN_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CIPSTA_DEF, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	ptr = strstr(cmd_resp, "+CIPSTA_DEF:");
	ptr = strstr(ptr, "ip:");
	// Return string is "+CIPSTA_CUR:ip:\"xx.xx.xx.xx\"\r\n"
	result = AT_Get_Param(ptr, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip_station[i] = (uint8_t)ip[i];
	}

	ptr++;
	ptr = strstr(ptr, "gateway:");
	// Return string is "+CIPSTA_CUR:gateway:\"xx.xx.xx.xx\"\r\n"
	result = AT_Get_Param(ptr, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip_gateway[i] = (uint8_t)ip[i];
	}

	ptr++;
	ptr = strstr(ptr, "netmask:");
	// Return string is "+CIPSTA_CUR:netmask:\"xx.xx.xx.xx\"\r\n"
	result = AT_Get_Param(ptr, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d.%d.%d.%d", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip_netmask[i] = (uint8_t)ip[i];
	}

