tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWSTARTSMART=<type>
//
// Function: Start SmartConfig
//
//	<type>
//		1 : ESP-Touch
//		2 : AirKiss
//		3 : ESP-Touch + AirKiss
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWSTARTSMART_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	type = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*type) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Create param string
	sprintf(cmd_param, "%d", type);
	// AT Command Process
	length = At_Command(CMD_CWSTARTSMART, Cmd_Set);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWSTARTSMART
//
// Function: Start SmartConfig
//
//	<type>
//		1 : ESP-Touch
//		2 : AirKiss
//		3 : ESP-Touch + AirKiss
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWSTARTSMART_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWSTARTSMART, Cmd_Execute);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CWSTOPSMART
//
// Function: Stop SmartConfig
//
//	<type>
//		1 : ESP-Touch
//		2 : AirKiss
//		3 : ESP-Touch + AirKiss
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CWSTOPSMART_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CWSTOPSMART, Cmd_Execute);

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// TCP/IP AT Command Set
//
///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTATUS
//
// Function: Check network connection status
//
//	<stat>
//		2 : Got IP
//		3 : Connected
//		4 : Disconnected
//	<link ID> ID of the connection(0~4), for multi-connect
//	<type> "TCP" or "UDP"
//	<remote IP> remote IP address
//	<remote port> remote port number
//	<local port> ESP8266 local port number
//	<tetype>
//		0 : ESP8266 runs as client
//		1 : ESP8266 runs as server
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTATUS_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPSTATUS_OUT*	param = (AT_CIPSTATUS_OUT*)output;
	char				ret_val[20];
	char*				ptr;
	bool				result;

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPSTATUS_OUT) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT Command Process
	length = At_Command(CMD_CIPSTATUS, Cmd_Execute);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Return string is "STATUS:<stat>\r\n"
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->stat);

	ptr = strstr(cmd_resp, "+CIPSTATUS:");
	// Return string is "+CIPSTATUS:<link ID>,<type>,<remote_IP>,<remote_port>,<local_port>,<tetype>\r\n"
	// Get <Link ID>
	result = AT_Get_Param(ptr, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->link_id);
	// Get <type>, "TCP" or "UDP"
	result = AT_Get_Param(ptr, 1, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	if(strcmp(ret_val, "TCP") == 0){
		// Type is "TCP"
		param->type = 0;
	}
	else{
		// Type is "UDP"
		param->type = 1;
	}
	// Get <remote IP>
	result = AT_Get_Param(ptr, 2, param->remote_ip, param->remote_ip_len);
	if(!result){
		return false;
	}
	// Get <remote port>
	result = AT_Get_Param(ptr, 3, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->remote_port);
	// Get <local port>
	result = AT_Get_Param(ptr, 4, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->local_port);
	// Get <tetype>
	result = AT_Get_Param(ptr, 5, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->tetype);

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTART
//
// Function: Establish TCP connection
//
//	<link ID> ID of network connection(used for multi-connection)
//	<type> "TCP" or "UDP"
//	<remote IP> remote IP address
//	<remote port> remote port number
//	<TCP keep alive>
//		0 : disable TCP keep-alive
//		1 ~ 7200 : detection time interval, unit : second
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTART_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPSTART_IN*	param = (AT_CIPSTART_IN*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPSTART_IN) > input_len){
		return false;
	}

	// Set "OK", "ERROR", and "ALREADY CONNECT" as Delimiter
	AT_Set_Delimiter(DLMT_Error);

	// TCP
	if(param->type){
		// Multiple connection
		if(multi_conn){
			if(param->TCP.set_keep_alive){
				sprintf(cmd_param, "%d, \"TCP\",\"%s\",%d,%d", param->link_id, param->remote_ip, param->remote_port, param->TCP.keep_alive);
			}
			else{
				sprintf(cmd_param, "%d,\"TCP\",\"%s\",%d", param->link_id, param->remote_ip, param->remote_port);
			}
		}
		// Single connection
		else{
			if(param->TCP.set_keep_alive){
				sprintf(cmd_param, "\"TCP\",\"%s\",%d,%d", param->remote_ip, param->remote_port, param->TCP.keep_alive);
			}
			else{
				sprintf(cmd_param, "\"TCP\",\"%s\",%d", param->remote_ip, param->remote_port);
			}
		}
	}

	// UDP
	else{
		// Multiple connection
		if(multi_conn){
			if(param->UDP.set_local_port){
				sprintf(cmd_param, "%d,\"UDP\",\"%s\",%d,%d,%d",
						param->link_id, param->remote_ip, param->remote_port, param->UDP.local_port, param->UDP.mode);
			}
			else{
				sprintf(cmd_param, "%d,\"UDP\",\"%s\",%d",
						param->link_id, param->remote_ip, param->remote_port);
			}
		}
		// Single connection
		else{
			if(param->UDP.set_local_port){
				sprintf(cmd_param, "\"UDP\",\"%s\",%d,%d,%d",
						param->remote_ip, param->remote_port, param->UDP.local_port, param->UDP.mode);
			}
			else{
				sprintf(cmd_param, "\"UDP\",\"%s\",%d",
						param->remote_ip, param->remote_port);
			}
		}
	}
	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// AT Command Process
	length = At_Command(CMD_CIPSTART, Cmd_Set);

