tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSEND
//
// Function: Send data
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSEND_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPSEND_IN*	param = (AT_CIPSEND_IN*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPSEND_IN) > input_len){
		return false;
	}

	// Multiple connection
	if(multi_conn){
		if(param->show_udp){
			sprintf(cmd_param, "%d,%d,\"%s\",%d", param->link_id, param->length, param->remote_ip, param->remote_port);
		}
		else{
			sprintf(cmd_param, "%d,%d", param->link_id, param->length);
		}
	}
	// Single connection
	else{
		if(param->show_udp){
			sprintf(cmd_param, "%d,\"%s\",%d", param->length, param->remote_ip, param->remote_port);
		}
		else{
			sprintf(cmd_param, "%d", param->length);
		}
	}

	// Set ">" as Delimiter
	AT_Set_Delimiter(DLMT_Send);
	// AT Command Process
	length = At_Command(CMD_CIPSEND, Cmd_Set);

	if(!strchr(cmd_resp, '>')){
		return false;
	}

	send_mode = true;

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSENDEX
//
// Function: Send data
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSENDEX_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPSEND_IN*	param = (AT_CIPSEND_IN*)input;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPSEND_IN) > input_len){
		return false;
	}

	// Multiple connection
	if(multi_conn){
		if(param->show_udp){
			sprintf(cmd_param, "%d,%d,\"%s\",%d", param->link_id, param->length, param->remote_ip, param->remote_port);
		}
		else{
			sprintf(cmd_param, "%d,%d", param->link_id, param->length);
		}
	}
	// Single connection
	else{
		if(param->show_udp){
			sprintf(cmd_param, "%d,\"%s\",%d", param->length, param->remote_ip, param->remote_port);
		}
		else{
			sprintf(cmd_param, "%d", param->length);
		}
	}

	// Set ">" as Delimiter
	AT_Set_Delimiter(DLMT_Send);
	// AT Command Process
	length = At_Command(CMD_CIPSENDEX, Cmd_Set);

	if(!strchr(cmd_resp, '>')){
		return false;
	}

	send_mode = true;

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPBUFSTATUS
//
// Function: Check status of TCP-send-buffer
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPBUFSTATUS_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*				link_id = (uint32_t*)input;
	AT_CIPBUFSTATUS_OUT*	param = (AT_CIPBUFSTATUS_OUT*)output;
	char					ret_val[20];
	bool					result;

	// Check input buffer length
	if(NULL == input || sizeof(*link_id) > input_len){
		return false;
	}

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPBUFSTATUS_OUT) > output_len){
		return false;
	}

	if(multi_conn){
		sprintf(cmd_param, "%d", *link_id);
		// Set "OK" and "ERROR" as Delimiter
		AT_Set_Delimiter(DLMT_Error);
		// AT Command Process
		length = At_Command(CMD_CIPBUFSTATUS, Cmd_Set);
	}
	else{
		// Set "OK" and "ERROR" as Delimiter
		AT_Set_Delimiter(DLMT_Error);
		// AT Command Process
		length = At_Command(CMD_CIPBUFSTATUS, Cmd_Execute);
	}

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Returned string is "<next segment ID>, < segment ID of which has sent >, < segment ID of which sent successfully>, <remain buffer size>, <queue number>"
	// Get next segment ID
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->next_segment);
	// Get segment ID of which has sent
	result = AT_Get_Param(cmd_resp, 1, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->sent_segment);
	// Get segment ID of which sent successfully
	result = AT_Get_Param(cmd_resp, 2, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->successful_segment);
	// Get remain buffer size
	result = AT_Get_Param(cmd_resp, 3, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->remain_buf_size);
	// Get queue number
	result = AT_Get_Param(cmd_resp, 4, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", &param->queue_number);

	return true;
}
///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPCHECKSEQ
//
// Function: Check if specific segment sent successfully or not
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPCHECKSEQ_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPCHECKSEQ_IN*	param = (AT_CIPCHECKSEQ_IN*)input;
	bool*				status = (bool*)output;
	uint32_t			index;
	char				ret_val[20];
	bool				result;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPCHECKSEQ_IN) > input_len){
		return false;
	}

	// Check input buffer length
	if(NULL == output || sizeof(*status) > output_len){
		return false;
	}

	if(multi_conn){
		sprintf(cmd_param, "%d,%d", param->link_id, param->segment_id);
		index = 2;
	}
	else{
		sprintf(cmd_param, "%d", param->segment_id);
		index = 1;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// AT Command Process
	length = At_Command(CMD_CIPCHECKSEQ, Cmd_Set);
	if(IsOK(cmd_resp)){
		return false;
	}
	// Get status
	result = AT_Get_Param(cmd_resp, index, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}

	if(strcmp(ret_val, "TRUE") == 0){
		*status = true;
	}
	else{
		*status = false;
	}

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPBUFRESET
//
// Function: Reset segment ID count
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPBUFRESET_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	link_id = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*link_id) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// Multiple connection
	if(multi_conn){
		sprintf(cmd_param, "%d", *link_id);
		// AT+CIPBUFRESET=<link ID>
		length = At_Command(CMD_CIPBUFRESET, Cmd_Set);
	}
	// Single connection
	else{
		// AT+CIPBUFRESET
		length = At_Command(CMD_CIPBUFRESET, Cmd_Execute);
	}

