tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPCLOSE
//
// Function: Close TCP or UDP connection
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPCLOSE_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	link_id = (uint32_t*)input;

	// Check input buffer length
	if(NULL == input || sizeof(*link_id) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// Multiple connection
	if(multi_conn){
		sprintf(cmd_param, "%d", *link_id);
		// AT+CIPBUFRESET=<link ID>
		length = At_Command(CMD_CIPCLOSE, Cmd_Set);
	}
	// Single connection
	else{
		// AT+CIPBUFRESET
		length = At_Command(CMD_CIPCLOSE, Cmd_Execute);
	}

	// Confirm OK string
	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIFSR
//
// Function: Get local IP address
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIFSR_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPADDR_OUT*	param = (AT_CIPADDR_OUT*)output;
	char			ret_val[20];
	bool			result;
	uint32_t		i;
	uint32_t		ip[4];

	// Check output buffer length
	if(NULL == output || sizeof(AT_CIPADDR_OUT) > output_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// AT+CIFSR
	length = At_Command(CMD_CIFSR, Cmd_Execute);
	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Get IP address
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "\"%d.%d.%d.%d\"", &ip[0], &ip[1], &ip[2], &ip[3]);
	for(i = 0; i < 4; i++){
		param->ip_station[i] = (uint8_t)ip[i];
	}

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPMUX?
//
// Function: Enable multiple connections or not
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPMUX_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	bool*		multi_mode = (bool*)output;
	char		ret_val[8];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*multi_mode) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT+CIPMUX?
	length = At_Command(CMD_CIPMUX, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", multi_mode);

	multi_conn = *multi_mode;

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPMUX=<mode>
//
// Function: Enable multiple connections or not
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPMUX_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	bool*		multi_mode = (bool*)input;
	bool		result;

	// Check input buffer length
	if(NULL == input || sizeof(*multi_mode) > input_len){
		return false;
	}

	// Set "OK" and "Link is builded" as Delimiter
	AT_Set_Delimiter(DLMT_Linked);
	sprintf(cmd_param, "%d", *multi_mode);
	// AT+CIPMUX?
	length = At_Command(CMD_CIPMUX, Cmd_Set);

	result = IsOK(cmd_resp);
	if(result){
		multi_conn = *multi_mode;
	}

	return result;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSERVER=<mode>[,<port>]
//
// Function: Configure as TCP server
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSERVER_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_CIPSERVER_IN*	param = (AT_CIPSERVER_IN*)input;
	bool				result;

	// Check input buffer length
	if(NULL == input || sizeof(AT_CIPSERVER_IN) > input_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// Set port
	if(param->server_mode){
		sprintf(cmd_param, "%d,%d", param->server_mode, param->port);
	}
	// Don't set port
	else{
		sprintf(cmd_param, "%d", param->server_mode);
	}
	// AT+CIPSERVER=<mode>[,<port>]
	length = At_Command(CMD_CIPSERVER, Cmd_Set);

	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPMODE?
//
// Function: Set transfer mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPMODE_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	bool*		mode = (bool*)output;
	char		ret_val[8];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*mode) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT+CIPMODE?
	length = At_Command(CMD_CIPMODE, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", mode);

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPMODE=<mode>
//
// Function: Set transfer mode
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPMODE_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	bool*		mode = (bool*)input;
	bool		result;

	// Check input buffer length
	if(NULL == input || sizeof(*mode) > input_len){
		return false;
	}

	// Set "OK" and "Link is builded" as Delimiter
	AT_Set_Delimiter(DLMT_Linked);
	sprintf(cmd_param, "%d", *mode);
	// AT+AT+CIPMODE=<mode>
	length = At_Command(CMD_CIPMODE, Cmd_Set);

	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+SAVETRANSLINK=<mode>,<remote IP>,<remote port>[,<type>][,<TCP keep alive>][,<UDP local port>]
//
// Function: Save transparent transmission link to Flash
//
///////////////////////////////////////////////////////////////////////////////
bool AT_SAVETRANSLINK_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_SAVETRANSLINK_IN*	param = (AT_SAVETRANSLINK_IN*)input;
	bool		result;

	// Check input buffer length
	if(NULL == input || sizeof(AT_SAVETRANSLINK_IN) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	// TCP
	if(param->type_tcp){
		if(param->TCP.set_keep_alive){
			sprintf(cmd_param, "%d,\"%s\",%d,\"TCP\",%d", param->mode, param->remote_ip, param->remote_port, param->TCP.keep_alive);
		}
		else{
			sprintf(cmd_param, "%d,\"%s\",%d,\"TCP\"", param->mode, param->remote_ip, param->remote_port);
		}
	}
	// UDP
	else{
		if(param->UDP.set_local_port){
			sprintf(cmd_param, "%d,\"%s\",%d,\"UDP\",%d", param->mode, param->remote_ip, param->remote_port, param->UDP.local_port);
		}
		else{
			sprintf(cmd_param, "%d,\"%s\",%d,\"UDP\"", param->mode, param->remote_ip, param->remote_port);
		}
	}
	// AT+SAVETRANSLINK=<mode>,<remote IP>,<remote port>...
	length = At_Command(CMD_SAVETRANSLINK, Cmd_Set);

	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTO?
//
// Function: Set TCP server timeout
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTO_Query(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	timeout = (uint32_t*)output;
	char		ret_val[8];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*timeout) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT+CIPMODE?
	length = At_Command(CMD_CIPSTO, Cmd_Query);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Get timeout value
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", timeout);

