tm1963/Test/WiFi_Driver/Sources/esp8266_at_command.c
	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPSTO=<timeout>
//
// Function: Set TCP server timeout
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPSTO_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	timeout = (uint32_t*)input;
	bool		result;

	// Check input buffer length
	if(NULL == input || sizeof(*timeout) > input_len){
		return false;
	}

	// Set "OK" and "Link is builded" as Delimiter
	AT_Set_Delimiter(DLMT_Linked);
	sprintf(cmd_param, "%d", *timeout);
	// AT+CIPSTO=<timeout>
	length = At_Command(CMD_CIPSTO, Cmd_Set);

	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+PING=<ip>
//
// Function: Function Ping
//
///////////////////////////////////////////////////////////////////////////////
bool AT_PING_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	AT_PING_IN*	param = (AT_PING_IN*)input;
	bool		result;

	// Check input buffer length
	if(NULL == input || sizeof(AT_PING_IN) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	sprintf(cmd_param, "\"%s\"", param->ip_string);
	// AT+PING=<ip>
	length = At_Command(CMD_PING, Cmd_Set);

	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIUPDATE
//
// Function: update through network
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIUPDATE_Exe(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	status = (uint32_t*)output;
	char		ret_val[8];
	bool		result;

	// Check output buffer length
	if(NULL == output || sizeof(*status) > output_len){
		return false;
	}

	// Set "OK" as Delimiter
	AT_Set_Delimiter(DLMT_Normal);
	// AT+CIUPDATE
	length = At_Command(CMD_CIUPDATE, Cmd_Execute);

	result = IsOK(cmd_resp);
	if(!result){
		return false;
	}

	// Get status value
	result = AT_Get_Param(cmd_resp, 0, ret_val, sizeof(ret_val));
	if(!result){
		return false;
	}
	sscanf(ret_val, "%d", status);

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// Command : AT+CIPDINFO=<mode>
//
// Function: Show remote IP and port with “+IPD” ( received data from network )
//
///////////////////////////////////////////////////////////////////////////////
bool AT_CIPDINFO_Set(void* input, uint32_t input_len, void* output, uint32_t output_len)
{
	uint32_t	length;
	uint32_t*	mode = (uint32_t*)input;
	bool		result;

	// Check input buffer length
	if(NULL == input || sizeof(*mode) > input_len){
		return false;
	}

	// Set "OK" and "ERROR" as Delimiter
	AT_Set_Delimiter(DLMT_Error);
	sprintf(cmd_param, "%d", *mode);
	// AT+CIPSTO=<timeout>
	length = At_Command(CMD_CIPDINFO, Cmd_Set);

	if(!*mode){
		show_remote_info = false;
	}
	else{
		show_remote_info = true;
	}

	return IsOK(cmd_resp);
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		At_Send_Tcp_Data
// 機能：
//		TCP/UDPにおいてデータを送信する。
//　引数：
//		buffer : 送信データバッファのポインタ
//		length : 送信データ長
// 戻り値
//		true - 成功、false - 失敗
//
///////////////////////////////////////////////////////////////////////////////
bool At_Send_Data(uint8_t* buffer, uint32_t length)
{
	uint32_t	status;

	// Check if send mode
	if(!send_mode){
		return false;
	}

	// Set delimiter
	AT_Set_Delimiter(DLMT_Sending);

	// Receive buffer clear
	cmd_resp[0] = '\0';
	// Set receive buffer
	Uart_Set_Receive_Buffer(UART_INDEX, cmd_resp, sizeof(cmd_resp));

	// Send data asynchronously
	Uart_Send_Data_Async(UART_INDEX, buffer, length);

//	do{
//		status = Uart_Get_Status(UART_INDEX);
//	}while(status != eUART_RX);
//	// Wait until receiving completed
//	do{
//		status = Uart_Get_Status(UART_INDEX);
//	}while(status != eUART_IDLE && status != eUART_TIMEOUT);

	// Wait until sending data completed
	while(!Is_AT_Completed()){
		continue;
	}

	// Reset receive buffer
	Uart_Set_Receive_Buffer(UART_INDEX, NULL, 0);

	// Check if sending data successful
	if(!strstr(cmd_resp, "SEND OK")){
		return false;
	}

	return true;
}

///////////////////////////////////////////////////////////////////////////////
//
// 関数名：
//		At_Exit_Send_Mode
// 機能：
//		"+++"を送信して送信データモードから抜ける。
//
///////////////////////////////////////////////////////////////////////////////
bool At_Exit_Send_Mode(void)
{
	bool	result;

	result = At_Send_Data("+++", 3);
	if(!result){
		return false;
	}

	send_mode = false;

	return true;
}
